# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

numpi = 3.1415926535897932384626433832795
numpi_acc = 1.1
calc_accuracy = int(input('Укажите точность вычисления Пи (количество знаков после запятой): '))
numpi_acc = ((numpi*(10**calc_accuracy))//1)/(10**calc_accuracy)
print('Число Пи: ', numpi_acc)